Revit 2015 API
DimensionTypeSet.Insert Method
Insert the specified dimension type into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual bool Insert(
	DimensionType item
)
Visual Basic
Public Overridable Function Insert ( _
	item As DimensionType _
) As Boolean
Visual C++
public:
virtual bool Insert(
	DimensionType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.DimensionType
The dimension type to be inserted into the set.
Return Value
Returns whether the dimension type was inserted into the set.
See Also
DimensionTypeSet Class
Autodesk.Revit.DB Namespace